Tekla Open API Reference for Tekla Structures 2025
Distance.ToString Method
Overload List
Name | Description
ToString()
 Creates a string representation of the distance.
 (Overrides ValueType.ToString().)
ToString(IFormatProvider)
 Creates a string representation of the distance.
ToString(String)
 Creates a string representation of the distance.
ToString(String, IFormatProvider)
 Creates a string representation of the distance.
ToString(String, IFormatProvider, Distance.UnitType)
 Creates a string representation of the distance.
Top
See Also
Reference
Distance Structure
Tekla.Structures.Datatype Namespace